
&НаКлиенте
Процедура ЗаказКоличествоПриИзменении(Элемент)
	ТаблицаЗаказ=Элементы.Заказ.ТекущиеДанные;
	ТаблицаЗаказ.Сумма=ТаблицаЗаказ.Количество*ТаблицаЗаказ.ЦенаЗаЕд;
	Объект.ИтоговаяСуммаЗаказа = Объект.Заказ.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ЗаказЦенаЗаЕдПриИзменении(Элемент)
	ТаблицаЗаказ=Элементы.Заказ.ТекущиеДанные;
	ТаблицаЗаказ.Сумма=ТаблицаЗаказ.Количество*ТаблицаЗаказ.ЦенаЗаЕд;
	Объект.ИтоговаяСуммаЗаказа = Объект.Заказ.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ЗаказСуммаПриИзменении(Элемент)
	ТаблицаЗаказ=Элементы.Заказ.ТекущиеДанные;
	ТаблицаЗаказ.Сумма=ТаблицаЗаказ.Количество*ТаблицаЗаказ.ЦенаЗаЕд;
	Объект.ИтоговаяСуммаЗаказа = Объект.Заказ.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	Объект.ИтоговаяСуммаЗаказа = Объект.Заказ.Итог("Сумма");
	КонецПроцедуры
