
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр АктЗапасы Приход
	Движения.АктЗапасы.Записывать = Истина;
	Для Каждого ТекСтрокаЗакупка Из Закупка Цикл
		Движение = Движения.АктЗапасы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Название = ТекСтрокаЗакупка.Название;
		Движение.Количество = ТекСтрокаЗакупка.Количество;
		Движение.ЦенаЗаЕдиницу = ТекСтрокаЗакупка.ЦенаЗаЕд;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
