
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Доставки") Тогда
		// Заполнение шапки
		АдресДоставки = ДанныеЗаполнения.АдресДоставки;
		ИтоговаяСумма = ДанныеЗаполнения.ИтоговаяСуммаЗаказа;
		ФИОКлиента = ДанныеЗаполнения.Наименование;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
