
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Чек") Тогда
		// Заполнение шапки
		ИтоговаяСуммаЗаказа = ДанныеЗаполнения.ИтоговаяСуммаЗаказа;
		НомерСтола = ДанныеЗаполнения.НомерСтола;
		Наименование = ДанныеЗаполнения.Официант;
		Для Каждого ТекСтрокаЗаказ Из ДанныеЗаполнения.Заказ Цикл
			НоваяСтрока = Заказ.Добавить();
			НоваяСтрока.Количество = ТекСтрокаЗаказ.Количество;
			НоваяСтрока.Название = ТекСтрокаЗаказ.Название;
			НоваяСтрока.Сумма = ТекСтрокаЗаказ.Сумма;
			НоваяСтрока.ЦенаЗаЕд = ТекСтрокаЗаказ.ЦенаЗаЕд;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
