
&НаКлиенте
Процедура ЗаказКоличествоПриИзменении(Элемент)
	ТаблицаЗаказов = Элементы.Заказ.ТекущиеДанные;
	ТаблицаЗаказов.Сумма = ТаблицаЗаказов.Количество*ТаблицаЗаказов.ЦенаЗаЕд;
	Объект.ИтоговаяСуммаЗаказа = Объект.Заказ.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ЗаказЦенаЗаЕдПриИзменении(Элемент)
	ТаблицаЗаказов = Элементы.Заказ.ТекущиеДанные;
	ТаблицаЗаказов.Сумма = ТаблицаЗаказов.Количество*ТаблицаЗаказов.ЦенаЗаЕд;
	Объект.ИтоговаяСуммаЗаказа = Объект.Заказ.Итог("Сумма");
КонецПроцедуры


&НаКлиенте
Процедура ЗаказСуммаПриИзменении(Элемент)
	ТаблицаЗаказ=Элементы.Заказ.ТекущиеДанные;
	ТаблицаЗаказ.Сумма=ТаблицаЗаказ.Количество*ТаблицаЗаказ.ЦенаЗаЕд;
	Объект.ИтоговаяСуммаЗаказа = Объект.Заказ.Итог("Сумма");
КонецПроцедуры

