
&НаКлиенте
Процедура СоставДоставкиСуммаПриИзменении(Элемент)
	ТаблицаСоставДоставки=Элементы.СоставДоставки.ТекущиеДанные;
	ТаблицаСоставДоставки.Сумма=ТаблицаСоставДоставки.Количество*ТаблицаСоставДоставки.ЦенаЗаЕд;
	Объект.ИтоговаяСуммаЗаказа = Объект.СоставДоставки.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СоставДоставкиЦенаЗаЕдПриИзменении(Элемент)
	ТаблицаСоставДоставки=Элементы.СоставДоставки.ТекущиеДанные;
	ТаблицаСоставДоставки.Сумма=ТаблицаСоставДоставки.Количество*ТаблицаСоставДоставки.ЦенаЗаЕд;
	Объект.ИтоговаяСуммаЗаказа = Объект.СоставДоставки.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СоставДоставкиКоличествоПриИзменении(Элемент)
	ТаблицаСоставДоставки=Элементы.СоставДоставки.ТекущиеДанные;
	ТаблицаСоставДоставки.Сумма=ТаблицаСоставДоставки.Количество*ТаблицаСоставДоставки.ЦенаЗаЕд;
	Объект.ИтоговаяСуммаЗаказа = Объект.СоставДоставки.Итог("Сумма");
КонецПроцедуры
