
&НаКлиенте
Процедура ДатаУвольненияПриИзменении(Элемент)
	Если Объект.ДатаУвольнения < Объект.ДатаПриёма Тогда
	Сообщить("Дата увольнения не может быть раньше даты приёма!");
	Объект.ДатаУвольнения = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриёмаПриИзменении(Элемент)
	ДатаСов = (18*365+4)*24*60*60;
	Если (Объект.ДатаПриёма - Объект.ДатаРождения) > ДатаСов Тогда
	//
	Иначе
	сбщ = Новый СообщениеПользователю;
	сбщ.Текст = "Соискатель должен достичь 18 лет для устройства на работу!";
	сбщ.Поле = "ДатаЗачисленияНаРаботу";
	сбщ.ПутьКДанным = "Объект";
	сбщ.Сообщить();
	
	Объект.ДатаПриёма = "";
	КонецЕсли;
КонецПроцедуры
